app/controllers/orgs_controller.rb

  def index
    @orgs=Org.all
---
SELECT "orgs".* FROM "orgs"

  def show
  	@org = Org.find(params[:id])
---
SELECT  "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def edit
    @org = Org.find(params[:id])
---
SELECT  "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @org = Org.find(params[:id])
    if @org.update_attributes(org_params)
---
SELECT  "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orgs" SET "org_street" = ?, "org_state" = ?, "org_category" = ?, "org_subcategory" = ?, "org_featured" = ?, "updated_at" = ? WHERE "orgs"."id" = ?  [["org_street", "50 Cross St."], ["org_state", "2"], ["org_category", "3"], ["org_subcategory", "1"], ["org_featured", true], ["updated_at", 2016-08-04 17:24:20 UTC], ["id", 2]]